(use gauche.test)
(require "./faTL")
(require "./farsi-engine")

(test-start "LESSON")

;;
;; Lesson 5
;;
(test-section "第5課 - 本文")
(test* "آن کتاب است" "あれは本です。" (fa->ja "آن کتاب است"))
(test* "اين کتاب است" "これは本です。" (fa->ja "اين کتاب است"))
(test* "اين کتاب بزرگ است" "この本は大きい。" (fa->ja "اين کتاب بزرگ است"))
(test* "آن سگ کوچک است" "あの犬は小さい。" (fa->ja "آن سگ کوچک است"))

(test-section "第5課 - 練習")
(test* "1) آن مداد است" "あれは鉛筆です。" (fa->ja "آن مداد است"))
(test* "2) اين اسب است" "これは馬です。" (fa->ja "اين اسب است"))
(test* "3) آن درخت است" "あれは木です。" (fa->ja "آن درخت است"))
(test* "4) اين کاغذ است" "これは紙です。" (fa->ja "اين کاغذ است"))
(test* "5) آن نان است" "あれはパンです。" (fa->ja "آن نان است"))
(test* "6) اين آب سرد است" "この水は冷たい。" (fa->ja "اين آب سرد است"))
(test* "7) آن گل قشنگ است" "あの花は美しい。" (fa->ja "آن گل قشنگ است"))
(test* "8) اين سیب بزرگ است" "このリンゴは大きい。" (fa->ja "اين سیب بزرگ است"))
(test* "9) اين گربه کوچک است" "この猫は小さい。" (fa->ja "اين گربه کوچک است"))
(test* "10) آن کاغذ سفید است" "あの紙は白い。" (fa->ja "آن کاغذ سفید است"))

;;
;; Lesson 6
;;
(test-section "第6課 - 本文")
(test* "آیا اين کتاب است ؟" "これは本ですか？" (fa->ja "آیا اين کتاب است ؟"))
(test* "اين کتاب است ؟" "これは本ですか？" (fa->ja "اين کتاب است ؟"))
(test* "آیا اين سگ است ؟" "これは犬ですか？" (fa->ja "آیا اين سگ است ؟"))
(test* "بله اين سگ است" "はい、これは犬です。" (fa->ja "بله اين سگ است"))
(test* "آیا اين گربه است ؟" "これは猫ですか？" (fa->ja "آیا اين گربه است ؟"))
(test* "نخیر اين گربه نیست" "いいえ、これは猫ではありません。" (fa->ja "نخیر اين گربه نیست"))
(test* "اين چیست ؟" "これは何ですか？" (fa->ja "اين چیست ؟"))
(test* "اينجا کجاست ؟" "ここはどこですか？" (fa->ja "اينجا کجاست ؟"))
(test* "آن چیست ؟" "あれは何ですか？" (fa->ja "آن چیست ؟"))
(test* "آن توت است" "あれは桑の実です。" (fa->ja "آن توت است"))
(test* "او کیست ؟" "彼は誰ですか？" (fa->ja "او کیست ؟"))
(test* "او هسین است" "彼はホセインです。" (fa->ja "او هسین است"))
(test* "اينجا کجاست ؟" "ここはどこですか？" (fa->ja "اينجا کجاست ؟"))
(test* "اينجا ايران است" "ここはイランです。" (fa->ja "اينجا ايران است"))

(test-section "第6課 - 練習")
(test* "1) آیا اين گل است ؟" "これは花ですか？" (fa->ja "آیا اين گل است ؟"))
(test* "   بله اين گل است" "はい、これは花です。" (fa->ja "بله اين گل است"))
(test* "2) آیا اين قلم است ؟" "これはペンですか？" (fa->ja "آیا اين قلم است ؟"))
(test* "   نخیر اين قلم نیست" "いいえ、これはペンではありません。" (fa->ja "نخیر اين قلم نیست"))
(test* "3) اين چیست ؟" "これは何ですか？" (fa->ja "اين چیست ؟"))
(test* "   اين میز است" "これは机です。" (fa->ja "اين میز است"))
(test* "4) آن چیست ؟" "あれは何ですか？" (fa->ja "آن چیست ؟"))
(test* "   آن صندلی است" "あれはいすです。" (fa->ja "آن صندلی است"))
(test* "5) اينجا کجاست ؟" "ここはどこですか？" (fa->ja "اينجا کجاست ؟"))
(test* "   اينجا ژاپن است" "ここは日本です。" (fa->ja "اينجا ژاپن است"))
(test-end)
